[
  {
    "title": "House sparrow sitting on wild angelica",
    "date": "April 20, 2025",
    "credit": "Photo by David Moll",
    "src": "DSC00144.jpg",
    "alt": "A house sparrow sitting on a branch of dry wild angelica",
    "fact": "House sparrows are excellent city birds—they’ve learned to open automatic doors by hopping on sensors and often hang out near cafés to snag crumbs!",
    "imgDir": "/images/"
  },
  {
    "title": "House sparrows surveying the area",
    "date": "April 20, 2025",
    "credit": "Photo by David Moll",
    "src": "DSC00165.jpg",
    "alt": "Two house sparrows sitting on a branch, each facing a different direction",
    "fact": "House sparrows take dust baths instead of water baths! They'll find a patch of dry dirt, create a shallow depression, and vigorously flap around in it to coat their feathers with dust. This helps them control parasites and maintain healthy plumage.",
    "imgDir": "/images/"
  },
  {
    "title": "Nutria gliding through the water",
    "date": "April 20, 2025",
    "credit": "Photo by David Moll",
    "src": "DSC00259.jpg",
    "alt": "A nutria swimming through the shallow water",
    "fact": "Nutrias (coypu) have bright orange-yellow front teeth! This distinctive coloration comes from iron compounds in their tooth enamel, which makes their incisors stronger for gnawing tough vegetation. Unlike many rodents whose teeth might appear yellowish from staining, the nutria's orange teeth are naturally that color from the inside out.",
    "imgDir": "/images/"
  },
  {
    "title": "Eurasian blue tit hanging from a tree",
    "date": "April 20, 2025",
    "credit": "Photo by David Moll",
    "src": "DSC00304.jpg",
    "alt": "A eurasian blue tit hanging effortlessly from a tree-branch",
    "fact": "Eurasian Blue Tits have incredible memories! They can hide up to 80,000 food items in different locations during autumn and remember where they stored them throughout winter.",
    "imgDir": "/images/"
  },
  {
    "title": "European red robin singing his song",
    "date": "April 20, 2025",
    "credit": "Photo by David Moll",
    "src": "DSC00386.jpg",
    "alt": "A european red robin loudly singing on top of a tree",
    "fact": "European Robins can see magnetic fields! They have special proteins in their eyes called cryptochromes that allow them to literally see Earth's magnetic field as a pattern of light and shadow superimposed on their vision.",
    "imgDir": "/images/"
  },
  {
    "title": "White-throated dipper sitting in a river",
    "date": "April 20, 2025",
    "credit": "Photo by David Moll",
    "src": "DSC00402.jpg",
    "alt": "A white-throated dipper sitting in a river looking for food",
    "fact": "The White-throated Dipper is Europe's only aquatic songbird! It can actually walk underwater along stream beds hunting for food. These remarkable birds have special flaps that close over their nostrils when submerged, extra-dense feathers for insulation, and powerful wings that they use to swim through fast-flowing water.",
    "imgDir": "/images/"
  },
  {
    "title": "Chiffchaff looking down from a tree",
    "date": "April 20, 2025",
    "credit": "Photo by David Moll",
    "src": "DSC00488.jpg",
    "alt": "A chiffchaff looking down from a tree",
    "fact": "Chiffchaffs and Willow Warblers are so similar in appearance that they were once thought to be the same species! Both are small, olive-brown warblers with pale underparts and slight eyebrow stripes.",
    "imgDir": "/images/"
  },
  {
    "title": "Drake Mallard taking a dive",
    "date": "April 21, 2025",
    "credit": "Photo by David Moll",
    "src": "DSC02281.jpg",
    "alt": "A drake mallard diving with its head underwater",
    "fact": "Male Mallards have vibrant green heads—but they molt after breeding season and look like females for a while!",
    "imgDir": "/images/"
  },
  {
    "title": "Blackbird looking at his next meal",
    "date": "April 21, 2025",
    "credit": "Photo by David Moll",
    "src": "DSC02290.jpg",
    "alt": "A male blackbird sitting in a tree looking directly at an insect flying infront of him",
    "fact": "Blackbirds have remarkable problem-solving abilities! They've been observed using tools in the wild - using stones to crack snail shells and strips of newspaper to drag food toward them.",
    "imgDir": "/images/"
  },
  {
    "title": "Chiffchaff sitting in a fir tree",
    "date": "April 20, 2025",
    "credit": "Photo by David Moll",
    "src": "DSC02308.jpg",
    "alt": "A small chiffchaff sitting in a fir tree",
    "fact": "Chiffchaffs are remarkable seasonal timekeepers! They're often called calendar birds in some European countries because they arrive and depart with such predictable timing that people historically used them to mark the changing seasons.",
    "imgDir": "/images/"
  },
  {
    "title": "Moorhen stretching its leg",
    "date": "April 20, 2025",
    "credit": "Photo by David Moll",
    "src": "DSC02342.jpg",
    "alt": "A moorhen sitting in a river stretching its left leg",
    "fact": "Moorhens have extraordinarily versatile feet! Unlike most birds, they can swim, walk on floating vegetation, climb trees, and even grasp branches with their exceptionally long toes that have no webbing.",
    "imgDir": "/images/"
  },
  {
    "title": "Eurasian yellow wagtail after a successful hunt",
    "date": "April 20, 2025",
    "credit": "Photo by David Moll",
    "src": "DSC02480.jpg",
    "alt": "A eurasian yellow wagtail sitting on some rocks next to a river with its beak full of insects",
    "fact": "Despite weighing only about 20 grams, these tiny birds make extraordinary migrations between Europe and sub-Saharan Africa, with some individuals traveling over 12,000 km round trip each year.",
    "imgDir": "/images/"
  },
  {
    "title": "German Shephard waiting for her next command",
    "date": "April 20, 2025",
    "credit": "Photo by David Moll",
    "src": "DSC02520.jpg",
    "alt": "A german shepard mix waiting for her next command with open ears",
    "fact": "German Shepherds have an incredible sense of smell with over 225 million scent receptors (humans have only about 5 million). This extraordinary ability allows them to detect odors at concentrations nearly 100,000 times lower than humans can perceive.",
    "imgDir": "/images/"
  },
  {
    "title": "House sparrow basking in the sun",
    "date": "April 21, 2025",
    "credit": "Photo by David Moll",
    "src": "DSC02594.jpg",
    "alt": "A female house sparrow perched on a branch",
    "fact": "These little city birds have lived alongside humans for thousands of years—some nests even show up in traffic lights!",
    "imgDir": "/images/"
  },
  {
    "title": "Willow Warbler hiding in a young tree",
    "date": "April 21, 2025",
    "credit": "Photo by David Moll",
    "src": "DSC02626.jpg",
    "alt": "A willow warbler hiding in a tree full of leaves",
    "fact": "It’s one of Europe’s longest-distance migrants—flying over 10,000 km to sub-Saharan Africa each year!",
    "imgDir": "/images/"
  },
  {
    "title": "Eurasian yellow wagtail sitting by the river",
    "date": "April 21, 2025",
    "credit": "Photo by David Moll",
    "src": "DSC02641.jpg",
    "alt": "A yellow wagtail sitting on a rock by the river",
    "fact": "True to its name, it constantly wags its tail—possibly to flush out insects from grass.",
    "imgDir": "/images/"
  },
  {
    "title": "Eurasian blue tit sitting on top of a black alder",
    "date": "April 21, 2025",
    "credit": "Photo by David Moll",
    "src": "DSC02650.jpg",
    "alt": "A eurasian blue tit sitting on top of a black alder",
    "fact": " These smart birds can remember which milk bottles had cream—famously pecking through foil lids in the UK!",
    "imgDir": "/images/"
  },
  {
    "title": "Eurasian blackcap hiding in a dense tree",
    "date": "April 21, 2025",
    "credit": "Photo by David Moll",
    "src": "DSC02662.jpg",
    "alt": "A eurasian blackcap hiding in a dense tree",
    "fact": "Some Eurasian Blackcaps now migrate to the UK for winter instead of the Mediterranean—evolving new traits thanks to garden bird feeders!",
    "imgDir": "/images/"
  },
  {
    "title": "Drake mallard looking down a river",
    "date": "April 21, 2025",
    "credit": "Photo by David Moll",
    "src": "DSC02678.jpg",
    "alt": "A drake mallard sitting at the edge of a river on top of some stones looking down said river",
    "fact": "That classic “quack” sound? It’s actually the female Mallard! Drakes are mostly quiet or make softer raspy sounds. So if you hear a loud quack—it’s probably not the guy!",
    "imgDir": "/images/"
  },
  {
    "title": "Eurasian blackcap looking for food",
    "date": "April 21, 2025",
    "credit": "Photo by David Moll",
    "src": "DSC02693.jpg",
    "alt": "A eurasian blackcap sitting in a tree looking out for food",
    "fact": "Despite its name, only the males have the signature black cap—females wear a reddish-brown one instead.",
    "imgDir": "/images/"
  },
  {
    "title": "Male blackbird hiding in the grass",
    "date": "April 21, 2025",
    "credit": "Photo by David Moll",
    "src": "DSC02706.jpg",
    "alt": "A male blackbird hiding in thick grass",
    "fact": "Male blackbirds can be super territorial—they’ll fiercely chase off rivals and even attack their own reflection thinking it's an intruder!",
    "imgDir": "/images/"
  },
  {
    "title": "Female blackbird collecting moss",
    "date": "April 21, 2025",
    "credit": "Photo by David Moll",
    "src": "DSC02720.jpg",
    "alt": "A female blackbird collecting moss in its beak",
    "fact": "Female blackbirds often start building the nest alone and can complete it in just a few days using grass, mud, and twigs.",
    "imgDir": "/images/"
  },
  {
    "title": "European red robin sitting on his throne",
    "date": "April 21, 2025",
    "credit": "Photo by David Moll",
    "src": "DSC02764.jpg",
    "alt": "A european red robin sitting on top of a tree-stump",
    "fact": "Despite their cute look, robins are surprisingly fierce—they’re super territorial and will even fight to the death over their patch of land!",
    "imgDir": "/images/"
  },
  {
    "title": "Drake mallard balancing on one leg",
    "date": "April 21, 2025",
    "credit": "Photo by David Moll",
    "src": "DSC02772.jpg",
    "alt": "A european red robin sitting on top of a tree-stump",
    "fact": "Drake mallards often stand on one leg to help conserve body heat. By tucking one leg into their feathers, they minimize heat loss, especially in colder environments.",
    "imgDir": "/images/"
  }
]
